
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_storage_blob.b2c_config[&#34;0&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["0"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "cab65528d0973b4e944abb82544d8ca8" -> "927796ab4471100bcc4486d56dcf9c7f" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "css/main.css"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":768,"Program":"tfcmt","SHA1":"","Vars":{}} -->